'use strict'
// ================ Task 1 ===================

let tempTc = +prompt('Введите температуру');
let tempTf = (9 / 5) * tempTc + 32;
alert('Температура по Фаренгейту : ' + tempTf);

// ================ Task 2 ===================

let admin, name;

name = "Василий";
admin = name;

console.log(admin);

// ================ Task 3 ===================

let res1 = 10 + 10 + '10' // 10 + 10 = 20 и + ("10" - строка)
console.log(res1);

let res2 = 10 + '10' + 10; // 10 + ("10" - строка) = 1010 и + 10 = 101010
console.log(res2);

let res3 = 10 + 10 + +'10'; // 10 + 10 = 20 и + ("10" - строка но с унарным "+") = 30
console.log(res3);

let res4 = 10 / -'';  // 10 делим на пустую строку с унарным "-", пустакая строка === false, а false === 0;
console.log(res4);

let res5 = 10 / +'2,5';
console.log(res5); // 10 делим на строку, т.к унарный "+" преобразует стрковое значение "3" в 3, а запятая мешает этому

